### SALARY PREDICTION

In [1]:
#Importing libraries 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [2]:
data = pd.read_csv('hiring.csv')

In [4]:
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [9]:
data.rename(columns= {'test_score(out of 10)': 'test_score', 'interview_score(out of 10)':'interview_score', 'salary($)':'salary'}, inplace=True)
data.head()

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [10]:
data['experience'].fillna(0, inplace=True)

In [11]:
data['test_score'].fillna(data['test_score'].mean(), inplace=True)

In [12]:
data.isnull()

   experience  test_score  interview_score  salary
0       False       False            False   False
1       False       False            False   False
2       False       False            False   False
3       False       False            False   False
4       False       False            False   False
5       False       False            False   False
6       False       False            False   False
7       False       False            False   False

In [13]:
x = data.iloc[:, :3]

In [16]:
#Convert the word to integers 
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8, 'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0:0}
    return word_dict[word]

In [17]:
x['experience'] = x['experience'].apply(lambda x: convert_to_int(x))

In [18]:
y = data.iloc[:, -1]

**SPLIT, TRAIN AND TEST**

No splitting as the data set is small.

In [21]:
from sklearn.linear_model import LinearRegression 
regressor = LinearRegression()

In [22]:
#Fit the model
regressor.fit(x, y)

LinearRegression()

In [23]:
#saving the model
pickle.dump(regressor, open('mod.pkl', 'wb'))

In [24]:
model = pickle.load(open('mod.pkl', 'rb'))
print(model.predict([[4, 5, 10]]))

[60082.30978002]